nodejs_vs_php_server/output.txt
GET: http://18.117.124.136/CSE-503S-PERFORMANCE-EVALUATION-STUDY/nodejs_vs_php_server/get.php
This is ApacheBench, Version 2.3 <$Revision: 1901567 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 18.117.124.136 (be patient)
Completed 200 requests
Completed 400 requests
Completed 600 requests
Completed 800 requests
Completed 1000 requests
Completed 1200 requests
Completed 1400 requests
Completed 1600 requests
Completed 1800 requests
Completed 2000 requests
Finished 2000 requests


Server Software:        Apache/2.4.54
Server Hostname:        18.117.124.136
Server Port:            80

Document Path:          /CSE-503S-PERFORMANCE-EVALUATION-STUDY/nodejs_vs_php_server/get.php
Document Length:        196 bytes

Concurrency Level:      300
Time taken for tests:   1.063 seconds
Complete requests:      2000
Failed requests:        0
Non-2xx responses:      2000
Total transferred:      740000 bytes
HTML transferred:       392000 bytes
Requests per second:    1882.03 [#/sec] (mean)
Time per request:       159.402 [ms] (mean)
Time per request:       0.531 [ms] (mean, across all concurrent requests)
Transfer rate:          680.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   4.0      2      19
Processing:    10  148  36.2    151     217
Waiting:        1  148  36.2    151     217
Total:         10  152  35.9    156     219

Percentage of the requests served within a certain time (ms)
  50%    156
  66%    172
  75%    181
  80%    188
  90%    193
  95%    198
  98%    212
  99%    217
 100%    219 (longest request)
----------------------------------------------------
POST: http://18.117.124.136/CSE-503S-PERFORMANCE-EVALUATION-STUDY/nodejs_vs_php_server/post.php
This is ApacheBench, Version 2.3 <$Revision: 1901567 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 18.117.124.136 (be patient)
Completed 200 requests
Completed 400 requests
Completed 600 requests
Completed 800 requests
Completed 1000 requests
Completed 1200 requests
Completed 1400 requests
Completed 1600 requests
Completed 1800 requests
Completed 2000 requests
Finished 2000 requests


Server Software:        Apache/2.4.54
Server Hostname:        18.117.124.136
Server Port:            80

Document Path:          /CSE-503S-PERFORMANCE-EVALUATION-STUDY/nodejs_vs_php_server/post.php
Document Length:        Variable

Concurrency Level:      300
Time taken for tests:   1.014 seconds
Complete requests:      2000
Failed requests:        0
Non-2xx responses:      2000
Total transferred:      740000 bytes
HTML transferred:       392000 bytes
Requests per second:    1972.00 [#/sec] (mean)
Time per request:       152.130 [ms] (mean)
Time per request:       0.507 [ms] (mean, across all concurrent requests)
Transfer rate:          712.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5   4.6      2      28
Processing:     6  140  34.0    148     196
Waiting:        0  140  34.0    147     196
Total:          6  145  33.5    152     215

Percentage of the requests served within a certain time (ms)
  50%    152
  66%    168
  75%    172
  80%    175
  90%    182
  95%    187
  98%    193
  99%    198
 100%    215 (longest request)
----------------------------------------------------