nodejs_vs_php_server/output.txt
This is ApacheBench, Version 2.3 <$Revision: 1901567 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 3.15.210.36 (be patient)


Server Software:        Apache/2.4.54
Server Hostname:        3.15.210.36
Server Port:            80

Document Path:          /CSE-503S-PERFORMANCE-EVALUATION-STUDY/nodejs_vs_php_server/get.php
Document Length:        196 bytes

Concurrency Level:      300
Time taken for tests:   1.121 seconds
Complete requests:      2000
Failed requests:        0
Non-2xx responses:      2000
Total transferred:      762000 bytes
HTML transferred:       392000 bytes
Requests per second:    1784.64 [#/sec] (mean)
Time per request:       168.101 [ms] (mean)
Time per request:       0.560 [ms] (mean, across all concurrent requests)
Transfer rate:          664.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    7   5.5      4      24
Processing:     7  153  33.3    165     198
Waiting:        1  153  33.3    165     198
Total:          7  160  31.4    171     202

Percentage of the requests served within a certain time (ms)
  50%    171
  66%    176
  75%    179
  80%    183
  90%    188
  95%    193
  98%    198
  99%    200
 100%    202 (longest request)
------------------------------------------------------------------------------------------------------------------
This is ApacheBench, Version 2.3 <$Revision: 1901567 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 3.15.210.36 (be patient)


Server Software:        Apache/2.4.54
Server Hostname:        3.15.210.36
Server Port:            80

Document Path:          /CSE-503S-PERFORMANCE-EVALUATION-STUDY/nodejs_vs_php_server/post.php
Document Length:        Variable

Concurrency Level:      300
Time taken for tests:   1.227 seconds
Complete requests:      2000
Failed requests:        0
Non-2xx responses:      2000
Total transferred:      762000 bytes
Total body sent:        496000
HTML transferred:       392000 bytes
Requests per second:    1630.64 [#/sec] (mean)
Time per request:       183.977 [ms] (mean)
Time per request:       0.613 [ms] (mean, across all concurrent requests)
Transfer rate:          606.71 [Kbytes/sec] received
                        394.92 kb/s sent
                        1001.63 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    9   5.2      6      26
Processing:    17  168  41.1    173     240
Waiting:        1  167  41.1    173     240
Total:         17  176  39.4    181     245

Percentage of the requests served within a certain time (ms)
  50%    181
  66%    194
  75%    200
  80%    203
  90%    227
  95%    233
  98%    237
  99%    239
 100%    245 (longest request)
------------------------------------------------------------------------------------------------------------------
This is ApacheBench, Version 2.3 <$Revision: 1901567 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 3.15.210.36 (be patient)


Server Software:        
Server Hostname:        3.15.210.36
Server Port:            3000

Document Path:          /
Document Length:        59 bytes

Concurrency Level:      300
Time taken for tests:   1.441 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      596000 bytes
HTML transferred:       118000 bytes
Requests per second:    1388.19 [#/sec] (mean)
Time per request:       216.108 [ms] (mean)
Time per request:       0.720 [ms] (mean, across all concurrent requests)
Transfer rate:          403.99 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   15   7.8     16      36
Processing:     9  191  44.6    196     272
Waiting:        2  134  37.6    141     202
Total:         10  206  46.0    209     297

Percentage of the requests served within a certain time (ms)
  50%    209
  66%    219
  75%    226
  80%    229
  90%    268
  95%    278
  98%    289
  99%    296
 100%    297 (longest request)
------------------------------------------------------------------------------------------------------------------
This is ApacheBench, Version 2.3 <$Revision: 1901567 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 3.15.210.36 (be patient)


Server Software:        
Server Hostname:        3.15.210.36
Server Port:            3000

Document Path:          /
Document Length:        Variable

Concurrency Level:      300
Time taken for tests:   1.678 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      596000 bytes
Total body sent:        372000
HTML transferred:       118000 bytes
Requests per second:    1192.16 [#/sec] (mean)
Time per request:       251.644 [ms] (mean)
Time per request:       0.839 [ms] (mean, across all concurrent requests)
Transfer rate:          346.94 [Kbytes/sec] received
                        216.54 kb/s sent
                        563.48 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   19  10.4     16      48
Processing:     7  218  46.1    220     310
Waiting:        1  153  48.3    156     242
Total:          7  236  46.8    235     325

Percentage of the requests served within a certain time (ms)
  50%    235
  66%    252
  75%    255
  80%    264
  90%    313
  95%    320
  98%    321
  99%    322
 100%    325 (longest request)
------------------------------------------------------------------------------------------------------------------